app/views/groups/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "group_users" ON "users"."id" = "group_users"."user_id" WHERE "group_users"."group_id" = ?  [["group_id", 3]]
---
            <td>
              <% @group.users.each do |member| %>